tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/adc_regs.h
/**
 * @file
 * @brief   Registers, Bit Masks and Bit Positions for the ADC Peripheral Module.
 */

/* ****************************************************************************
 * Copyright (C) 2016 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 * $Date: 2017-02-14 18:08:19 -0600 (Tue, 14 Feb 2017) $
 * $Revision: 26419 $
 *
 *************************************************************************** */

/* Define to prevent redundant inclusion */
#ifndef _MXC_ADC_REGS_H_
#define _MXC_ADC_REGS_H_
/// @cond
/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif


/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */
/**
 * @ingroup     group_adc
 * @defgroup    adc_registers Registers
 * @brief       Registers, Bit Masks and Bit Positions
 * @{
 */

/**
 * Structure type to access the ADC Registers.
 */
typedef struct {
    __IO uint32_t ctrl;                                     /**< <b><tt>0x000</tt>:</b> ADC CTRL Register                            */
    __IO uint32_t status;                                   /**< <b><tt>0x004</tt>:</b> ADC STATUS Register                          */
    __IO uint32_t data;                                     /**< <b><tt>0x008</tt>:</b> ADC DATA Register                            */
    __IO uint32_t intr;                                     /**< <b><tt>0x00C</tt>:</b> ADC INTR Register                            */
    __IO uint32_t limit[4];                                 /**< <b><tt>0x010</tt>:</b> ADC LIMIT0, LIMIT1, LIMIT2, LIMIT3 Register  */
    __IO uint32_t afe_ctrl;                                 /**< <b><tt>0x020</tt>:</b> ADC AFE_CTRL Register                        */
    __IO uint32_t ro_cal0;                                  /**< <b><tt>0x024</tt>:</b> ADC RO_CAL0 Register                         */
    __IO uint32_t ro_cal1;                                  /**< <b><tt>0x028</tt>:</b> ADC RO_CAL1 Register                         */
    __IO uint32_t ro_cal2;                                  /**< <b><tt>0x02C</tt>:</b> ADC RO_CAL2 Register                         */
} mxc_adc_regs_t;
/** @} */

/**
 * @ingroup    adc_registers
 * @defgroup   ADC_Register_Offsets Register Offsets
 * @brief      ADC Peripheral Register Offsets from the ADC Base Peripheral Address. 
 * @{
 */
#define MXC_R_ADC_OFFS_CTRL                                 ((uint32_t)0x00000000UL) /**< Offset from ADC Base Address: <b><tt>0x000</tt></b>  */
#define MXC_R_ADC_OFFS_STATUS                               ((uint32_t)0x00000004UL) /**< Offset from ADC Base Address: <b><tt>0x004</tt></b>  */
#define MXC_R_ADC_OFFS_DATA                                 ((uint32_t)0x00000008UL) /**< Offset from ADC Base Address: <b><tt>0x008</tt></b>  */
#define MXC_R_ADC_OFFS_INTR                                 ((uint32_t)0x0000000CUL) /**< Offset from ADC Base Address: <b><tt>0x00C</tt></b>  */
#define MXC_R_ADC_OFFS_LIMIT0                               ((uint32_t)0x00000010UL) /**< Offset from ADC Base Address: <b><tt>0x010</tt></b>  */
#define MXC_R_ADC_OFFS_LIMIT1                               ((uint32_t)0x00000014UL) /**< Offset from ADC Base Address: <b><tt>0x014</tt></b>  */
#define MXC_R_ADC_OFFS_LIMIT2                               ((uint32_t)0x00000018UL) /**< Offset from ADC Base Address: <b><tt>0x018</tt></b>  */
#define MXC_R_ADC_OFFS_LIMIT3                               ((uint32_t)0x0000001CUL) /**< Offset from ADC Base Address: <b><tt>0x01C</tt></b>  */
#define MXC_R_ADC_OFFS_AFE_CTRL                             ((uint32_t)0x00000020UL) /**< Offset from ADC Base Address: <b><tt>0x020</tt></b>  */
#define MXC_R_ADC_OFFS_RO_CAL0                              ((uint32_t)0x00000024UL) /**< Offset from ADC Base Address: <b><tt>0x024</tt></b>  */
#define MXC_R_ADC_OFFS_RO_CAL1                              ((uint32_t)0x00000028UL) /**< Offset from ADC Base Address: <b><tt>0x028</tt></b>  */
#define MXC_R_ADC_OFFS_RO_CAL2                              ((uint32_t)0x0000002CUL) /**< Offset from ADC Base Address: <b><tt>0x02C</tt></b>  */
/** @} end of group  */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_CTRL_Register ADC_CTRL
 * @brief    Field Positions and Bit Masks for the ADC_CTRL register
 * @{
 */
#define MXC_F_ADC_CTRL_CPU_ADC_START_POS                    0                                                                   /**< CPU_ADC_START Position         */
#define MXC_F_ADC_CTRL_CPU_ADC_START                        ((uint32_t)(0x00000001UL << MXC_F_ADC_CTRL_CPU_ADC_START_POS))      /**< CPU_ADC_START Mask             */
#define MXC_F_ADC_CTRL_ADC_PU_POS                           1                                                                   /**< ADC_PU Position                */ 
#define MXC_F_ADC_CTRL_ADC_PU                               ((uint32_t)(0x00000001UL << MXC_F_ADC_CTRL_ADC_PU_POS))             /**< ADC_PU Mask                    */
#define MXC_F_ADC_CTRL_BUF_PU_POS                           2                                                                   /**< BUF_PU Position                */
#define MXC_F_ADC_CTRL_BUF_PU                               ((uint32_t)(0x00000001UL << MXC_F_ADC_CTRL_BUF_PU_POS))             /**< BUF_PU Mask                    */
#define MXC_F_ADC_CTRL_ADC_REFBUF_PU_POS                    3                                                                   /**< REFBUF_PU Position             */
#define MXC_F_ADC_CTRL_ADC_REFBUF_PU                        ((uint32_t)(0x00000001UL << MXC_F_ADC_CTRL_ADC_REFBUF_PU_POS))      /**< REFBUF_PU Mask                 */
#define MXC_F_ADC_CTRL_ADC_CHGPUMP_PU_POS                   4                                                                   /**< CHGPUMP_PU Position            */
#define MXC_F_ADC_CTRL_ADC_CHGPUMP_PU                       ((uint32_t)(0x00000001UL << MXC_F_ADC_CTRL_ADC_CHGPUMP_PU_POS))     /**< CHGPUMP_PU Mask                */
#define MXC_F_ADC_CTRL_BUF_CHOP_DIS_POS                     5                                                                   /**< BUF_CHOP_DIS Position          */
#define MXC_F_ADC_CTRL_BUF_CHOP_DIS                         ((uint32_t)(0x00000001UL << MXC_F_ADC_CTRL_BUF_CHOP_DIS_POS))       /**< BUF_CHOP_DIS Mask              */
#define MXC_F_ADC_CTRL_BUF_PUMP_DIS_POS                     6                                                                   /**< BUF_PUMP_DIS Position          */
#define MXC_F_ADC_CTRL_BUF_PUMP_DIS                         ((uint32_t)(0x00000001UL << MXC_F_ADC_CTRL_BUF_PUMP_DIS_POS))       /**< BUF_PUMP_DIS Mask              */
#define MXC_F_ADC_CTRL_BUF_BYPASS_POS                       7                                                                   /**< BUF_BYPASS Position            */
#define MXC_F_ADC_CTRL_BUF_BYPASS                           ((uint32_t)(0x00000001UL << MXC_F_ADC_CTRL_BUF_BYPASS_POS))         /**< BUF_BYPASS Mask                */
#define MXC_F_ADC_CTRL_ADC_REFSCL_POS                       8                                                                   /**< ADC_REFSCL Position            */
#define MXC_F_ADC_CTRL_ADC_REFSCL                           ((uint32_t)(0x00000001UL << MXC_F_ADC_CTRL_ADC_REFSCL_POS))         /**< ADC_REFSCL Mask                */
#define MXC_F_ADC_CTRL_ADC_SCALE_POS                        9                                                                   /**< ADC_SCALE Position             */
#define MXC_F_ADC_CTRL_ADC_SCALE                            ((uint32_t)(0x00000001UL << MXC_F_ADC_CTRL_ADC_SCALE_POS))          /**< ADC_SCALE Mask                 */
#define MXC_F_ADC_CTRL_ADC_REFSEL_POS                       10                                                                  /**< ADC_REFSEL Position            */ 
#define MXC_F_ADC_CTRL_ADC_REFSEL                           ((uint32_t)(0x00000001UL << MXC_F_ADC_CTRL_ADC_REFSEL_POS))         /**< ADC_REFSEL Mask                */
#define MXC_F_ADC_CTRL_ADC_CLK_EN_POS                       11                                                                  /**< ADC_CLK_EN Position            */ 
#define MXC_F_ADC_CTRL_ADC_CLK_EN                           ((uint32_t)(0x00000001UL << MXC_F_ADC_CTRL_ADC_CLK_EN_POS))         /**< ADC_CLK_EN Mask                */
#define MXC_F_ADC_CTRL_ADC_CHSEL_POS                        12                                                                  /**< ADC_CHSEL Position             */ 
#define MXC_F_ADC_CTRL_ADC_CHSEL                            ((uint32_t)(0x0000000FUL << MXC_F_ADC_CTRL_ADC_CHSEL_POS))          /**< ADC_CHSEL Mask                 */

